Revit 2024 API
FillGrid Members
The FillGrid type exposes the following members.
Constructors
Name | Description
FillGrid()
 Creates a simple fill grid.
FillGrid(FillGrid)
 Constructs a new FillGrid with default settings.
FillGrid(Double, Double)
 Creates a simple fill grid with given angle and offset.
Methods
Name | Description
CalculateLengthPerArea
 Calculates length of the pattern per unit area.
CalculateLinesPerLength
 Calculates the number of solid lines of the pattern per unit length.
CalculateStrokesPerArea
 Calculates the number of the segments of the pattern per unit area.
Dispose
Releases all resources used by the FillGrid
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetHatchingDirection
 Provides the hatching propagation. Hatching is inverted.
GetPointLineZone(UV)
 Gets the index of fill grid line closest to the input 2d point.
GetPointLineZone(UV, UV)
 Gets the index of fill grid line and the point on the grid line nearest to the input point.
GetSegmentDirection
 Provides the segment direction.
GetSegments
 Gets the segments of the fill grid.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsEqual
 Check if two fill grids are equal.
SetSegments
 Sets the segments to the fill grid.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Angle
 Gets and sets the angle of the fill grid.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Offset
 Gets and sets the offset of the fill grid.
Origin
 Gets and sets the origin of the fill grid.
Shift
 Gets and sets the shift of the fill grid.
See Also
FillGrid Class
Autodesk.Revit.DB Namespace